Repository: fransschreuder/usbpicprog
Catalog: trunk/upp_wx/po/*.po
Languages: es

source: Connected
es: Conectado

source: and
es: y

source: failed at 0x%X. Read: 0x%02X, Expected: 0x%02X
es: falló en 0x%X. Leído: 0x%02X, Esperado: 0x%02X

source: %s [%d pins]
es: %s [%d pines]

source: %s datasheet
es: Hoja de características del %s

source: &About
es: &Acerca de

source: &Actions
es: A&cciones

source: &Autodetect...
es: &Autodetectar...

source: &Blankcheck...
es: C&omprobación de borrado...

source: &Copy
es: &Copiar

source: &Edit
es: &Editar

source: &Erase...
es: &Borrar...

source: &File
es: &Archivo

source: &Help
es: A&yuda

source: &IO Test
es: &Test de E/S

source: &New
es: &Nuevo

source: &Open
es: &Abrir

source: &Options
es: &Opciones

source: &Preferences
es: &Preferencias

source: &Program...
es: &Programar...

source: &Read...
es: &Leer...

source: &Reload
es: &Recargar

source: &Save
es: &Guardar

source: &Select PIC...
es: &Seleccionar PIC...

source: &Upgrade firmware
es: &Actualizar el firmware

source: &Verify...
es: &Verificar...

source: . Upgrade firmware?
es: . ¿Actualizar el firmware?

source: All operations completed
es: Todas las operaciones completadas

source: An open source USB pic programmer
es: Programador de pic por USB de código abierto

source: Autodetect on Connect
es: Autodetectar al Conectar

source: Blankcheck failed at 0x%X. Read: 0x%02X, Expected: 0x%02X
es: La comprobación de borrado falló en 0x%X. Leído: 0x%02X, Esperado: 0x%02X

source: Blankcheck the PIC device
es: Comprobar si el dispositivo PIC está vacío

source: Bootloader or programmer not found
es: Bootloader o programador no encontrado

source: Can't create the package bitmap!
es: ¡No se puede crear el bitmap del encapsulado!

source: Can't draw the PIC package!
es: No se puede dibujar el encapsulado del PIC

source: Cannot load '%s'.
es: No se puede cargar '%s'

source: Cannot load XML PIC data.
es: No se puede cargar los datos XML del PIC

source: Cannot select a different PIC when the bootloader is connected!
es: ¡No se puede seleccionar un PIC diferente cuando el bootloader está conectado!

source: Change the currently selected PIC
es: Cambiar el PIC seleccionado actualmente

source: Checking if the device is blank...
es: Comprobando si el dispositivo está vacío...

source: Code
es: Código

source: Code Memory
es: Memoria de Código

source: Code memory size:
es: Tamaño de la memoria de código:

source: Code memory size: %d bytes
es: Tamaño de la memoria de código: %d bytes

source: Configuration Word:
es: Palabra de Configuración:

source: Configuration flags
es: Palabras de configuración

source: Configuration flags for this PIC:
es: Palabras de configuración para este PIC:

source: Connect Options
es: Opciones de conexión

source: Copies to the clipboard currently selected cells
es: Copia al portapapeles las celdas actualmente seleccionadas

source: Copy
es: Copiar

source: Could not access the 'xml_data' folder.
es: No se pudo acceder a la carpeta 'xml_data'

source: Could not create the worker thread!
es: ¡No se pudo crear el hilo de trabajo!

source: Could not initialize libusb. This may happen because of: 1) an incorrect installation of the UsbPicProg driver; check if this is the case running the Windows Device Manager with the programmer attached; 2) An incorrect installation of cfgmgr32.dll, winusb.dll or hid.dll; Please re-install UsbPicProg and ensure that Windows recognizes the UsbPicProg hardware when it's attached to the USB bus. If Windows asks for a driver please point it to the 'UsbPicProg\driver' directory which has been installed in your Programs folder. If you still have problems please drop a mail on the UsbPicProg mailing list including your 'DPINST.LOG' file (which is located in your 'Windows\System32' folder).
es: No se pudo inicializar libusb. Esto podría ocurrir por: 1) Una incorrecta instalación del driver de UsbPicProg; compruebe si es este caso abriendo el Administrador de Dispositivos de Windows con el programador conectado; 2) Una incorrecta instalación de cfgmgr32.dll, winusb.dll o hid.dll; Por favor reinstale UsbPicProg y asegúrese de que Windows reconoce el hardware UsbPicProg cuando está conectado al bus USB. Si Windows pide un driver por favor seleccione la carpeta 'UsbPicProg\driver', la cual ha sido instalada su carpeta de programas. Si sigue teniendo problemas por favor envíe un email a la lista de correo de UsbPicProg incluyendo tu archivo 'DPINST.LOG' (el cual se encuentra en su carpeta 'Windows\System32').

source: Could not initialize libusb: %s
es: No se pudo inicializar libusb: %s

source: Could not load data for PIC '%s'.
es: No se pudo cargar los datos para el PIC '%s'

source: Could not open Hex file for writing...
es: No se pudo abrir el archivo Hex para escritura...

source: Could not open Hex file...
es: No se pudo abrir el archivo Hex...

source: Could not run the worker thread!
es: ¡No se pudo ejecutar el hilo de trabajo!

source: Couldn't reset the USB device interface: %s
es: No se pudo resetear la interfaz USB del dispositivo: %s

source: Current HW state:
es: Estado de HW actual:

source: Current HW voltage:
es: Voltaje de HW actual:

source: Current value for the %d-th configuration word as derived from above configuration choices
es: Valor actual para la %dª palabra de configuración obtenida de las elecciones de configuración de arriba

source: Data
es: Datos

source: Data in hex file outside code memory of PIC
es: Datos en el archivo hex fuera de la memoria de código del PIC

source: Data in hex file outside config memory of PIC
es: Datos en el archivo hex fuera de la memoria de configuración del PIC

source: Data in hex file outside data memory of PIC
es: Datos en el archivo hex fuera de la memoria de datos del PIC

source: Data memory size:
es: Tamaño de la memoria de datos:

source: Data memory size: %d bytes
es: Tamaño de la memoria de datos: %d bytes

source: Datasheet
es: Hoja de características

source: Detect the type of the PIC device
es: Detectar el tipo de dispositivo PIC

source: Detected PIC model %s with device ID 0x%X
es: Detectado modelo de PIC %s con ID de dispositivo 0x%X

source: Device ID:
es: ID de dispositivo:

source: Device ID: 0x%X
es: ID de dispositivo: 0x%X

source: Device is blank
es: El dispositivo está vacío

source: Device is not blank.
es: El dispositivo no está vacío.

source: Device is self powered (disable VDD)
es: El dispositivo es auto alimentado (desactivar VDD)

source: Device is self powered, disable VDD
es: El dispositivo es auto alimentado, desactivar VDD

source: Disconnected
es: Desconectado

source: E&xit
es: &Salir

source: Edit
es: Editar

source: Erase OK
es: Borrado OK

source: Erase before programming
es: Borrar antes de programar

source: Erase the PIC device
es: Borrar el dispositivo PIC

source: Erasing all areas of the PIC...
es: Borrando todas las áreas del PIC...

source: Erasing before programming...
es: Borrar antes de programar...

source: Error claiming the USB device interface: %s
es: Error solicitando la interfaz USB del dispositivo: %s

source: Error erasing the device
es: Error borrando el dispositivo

source: Error getting USB endpoint descriptor: %s
es: Error obteniendo el descriptor de endpoint del USB: %s

source: Error in checksum...
es: Error en la suma de verificación...

source: Error programming code memory
es: Error al programar la memoria de código

source: Error programming config memory
es: Error programando la memoria de configuración

source: Error programming data memory
es: Error programando memoria de datos

source: Error reading code memory
es: Error al leer la memoria de código

source: Error reading configuration memory
es: Error de lectura la memoria de configuración

source: Error reading data memory
es: Error de lectura la memoria de datos

source: Error restoring Calibration Registers
es: Error restaurando los Registros de Calibración

source: Error setting configuration of the USB device: %s
es: Error estableciendo la configuración: %s

source: Examples
es: Ejemplos

source: Exits the program
es: Sale del programa

source: Failure in hex file...
es: Fallo en el archivo hex...

source: Firmware probably too new
es: Firmware probablemente demasiado nuevo

source: Fit package drawing
es: Ajustar el dibujo del encapsulado

source: Frequency range: Min=%.2fMhz Max=%.2fMhz
es: Rango de frecuencia: Mín=%.2fMhz Máx=%.2fMhz

source: GUI options
es: Opciones de la interfaz gráfica

source: Global settings for Usbpicprog:
es: Ajustes globales para Usbpicprog:

source: HEX files (*.hex)|*.hex|HEX files (*.HEX)|*.HEX
es: archivos HEX (*.hex)|*.hex|archivos HEX (*.HEX)|*.HEX

source: Hexadecimal view of the code area of the PIC:
es: Vista en Hexadecimal del área de código del PIC:

source: Hexadecimal view of the data area of the PIC:
es: Vista en Hexadecimal del área de datos del PIC:

source: I'm sorry for being stupid
es: Perdón por ser estúpido

source: In this dialog you can test the UsbPicProg hardware by sending requests to set a specific voltage on a specific output pin. The real voltage of the VPP pin and the other pins' statuses are updated once per second and are reported in bold below.
es: En este diálogo puede probar el hardware UsbPicProg mediante el envío de peticiones para establecer un voltaje específico en un pin de salida específico. El voltaje real del pin VPP y los estados de los otros pines se actualizan una vez por segundo y son reportados en negrita debajo.

source: Initializing...
es: Inicializando...

source: Input/output test
es: Test de entrada/salida

source: Invalid '%s' file.
es: Archivo '%s' inválido

source: Invalid PIC family for PIC '%s'.
es: Familia de PIC inválida para el PIC '%s'

source: Invalid direction
es: Dirección inválida

source: Invalid odd pin count: %d
es: Cuenta de pines impares inválida: %d

source: Invalid pin count: %d
es: Cuenta de pines inválida: %d

source: Length: %d bits
es: Longitud: %d bits

source: Limit PGD and PGC to 3.3V
es: Limitar PGD y PGC a 3.3V

source: Limit VPP to 5V
es: Limitar VPP a 5V

source: Loads an HEX file for editing or programming...
es: Carga un fichero HEX para su edición o programación...

source: Localize Usbpicprog in your System Language
es: Localice Usbpicprog en el idioma de su sistema

source: Location in memory: 0x%X
es: Localización en memoria: 0x%X

source: Miscellaneous
es: Misceláneo

source: No PIC detected!
es: ¡No se ha detectado ningún PIC!

source: No PIC detected! Selecting the default PIC (%s)...
es: ¡No se ha detectado ningún PIC! Seleccionando el PIC por defecto (%s)...

source: No data to verify
es: No hay datos que verificar

source: No file to refresh
es: No hay archivo que refrescar

source: Note: red pins are (some of those) used in ICSP.
es: Nota: los pines rojos (algunos de ellos) son usados en ICSP

source: Only valid for PIC12F629, PIC12F508, 10F20X and similar devices...
es: Sólo válido para PIC12F629, PIC12F508, 10F20X y dispositivos similares...

source: Open a .hex file from the examples folder
es: Abrir un archivo .hex de la carpeta de ejemplos

source: Open firmware file
es: Abrir un archivo de firmware

source: Open hexfile
es: Abrir archivo HEX

source: Opens the Usbpicprog's website...
es: Abre la página web de Usbpicprog...

source: Operations aborted
es: Operaciones abortadas

source: Operations completed with errors/warnings
es: Operaciones completadas con errores/advertencias

source: PGC pin
es: Pin PGC

source: PGD pin
es: Pin PGD

source: PIC info
es: Información del PIC

source: Package
es: Encapsulado

source: Please confirm
es: Por favor confirme

source: Please specify a BandGap Value between 0 and 3
es: Por favor especifique un valor de BandGap entre 0 y 3

source: Please specify a bandgap value
es: Por favor, especifique un valor de bandgap

source: Please specify a new Osccal Value [0xC00 - 0xCFF]
es: Por favor especifique un nuevo valor de Osccal [0xC00 - 0xCFF]

source: Please specify a new Osccal Value [3400 - 37FF]
es: Por favor especifique un nuevo valor de Osccal [3400 - 37FF]

source: Please specify an Oscal Value between
es: Por favor especifique un valor de Osccal entre

source: Please specify an Oscal Value between %X and %X
es: Por favor especifique un valor de Osccal entre %X y %X

source: Please wait until the operations are completed:
es: Por favor, espere hasta que las operaciones se hayan completado:

source: Preferences
es: Preferencias

source: Program options
es: Opciones de programación

source: Program the PIC device
es: Programar el dispositivo PIC

source: Programming configuration area of the PIC...
es: Programando área de configuración del PIC...

source: Programming the code area of the PIC...
es: Programando el área de código del PIC...

source: Programming the data area of the PIC...
es: Programando el área de datos del PIC...

source: Programming voltage (Vpp): Min=%.2fV Nom=%.2fV Max=%.2fV
es: Voltaje de programación (Vpp): Mín=%.2fV Nom=%.2fV Máx=%.2fV

source: Progress dialog
es: Diálogo de progreso

source: Read the PIC device
es: Leer el dispositivo PIC

source: Reading the code area of the PIC...
es: Leyendo el área de código del PIC...

source: Reading the configuration area of the PIC...
es: Leyendo el área de configuración del PIC...

source: Reading the data area of the PIC...
es: Leyendo el área de datos del PIC...

source: Reboot option not available in this firmware, please remove the select jumper and disconnect / reconnect your usbpicprog.
es: Opción de reinicio no disponible en este firmware, por favor quite el jumper y desconecte / reconecte su usbpicprog.

source: Reloads the current HEX file from disk
es: Recargar el archivo HEX actual

source: Resets the code, configuration and data areas of the currently open HEX file
es: Resetear las áreas de código, configuración y datos del fichero HEX abierto

source: Restore BandGap Register
es: Restaurar el Registro Bandgap

source: Restore Cal regs...
es: Restaurar los registros Cal...

source: Restore Osccal Register
es: Restaurar el Registro Osccal

source: Restore PIC's calibration registers
es: Restaurar los registros de calibración del PIC

source: Run Target
es: Ejecutar Destino

source: Save &As
es: Guardar &Como

source: Save hexfile
es: Guardar archivo HEX

source: Saves current code,config,data as a HEX file
es: Guarda el código actual, configuración, datos como un fichero HEX

source: Saves the HEX file with the modified data
es: Guarda el archivo HEX con los datos modificados

source: Select &All
es: &Seleccionar Todo

source: Select All
es: Seleccionar Todo

source: Selects the entire grid currently shown
es: Selecciona la rejilla entera mostrada actualmente

source: Set 0V to MCLR to stop the target controller
es: Establecer 0V a MCLR para detener el controlador destino

source: Set 5V to MCLR to run the target controller
es: Establecer 5V a MCLR para ejecutar el controlador destino

source: Shows informations about this program
es: Muestra informaciones acerca de este programa

source: Shows popups on connect etc...
es: Muestra popups al conectar, etc...

source: Shows the options for this program
es: Muestra las opciones para este programa

source: Specify a bandgap value
es: Especificar un valor de bandgap

source: Specify a new Osccal Value
es: Especificar un nuevo valor de Osccal

source: Stop Target
es: Detener Destino

source: Supply voltage (Vdd): Min=%.2fV Nom=%.2fV Max=%.2fV
es: Voltaje de alimentación (Vdd): Mín=%.2fV Nom=%.2fV Máx=%.2fV

source: The HEX file '%s' has not been saved... its content will be lost; continue?
es: El fichero HEX '%s' no se ha guardado... su contenido se perderá; ¿continuar?

source: The hardware should ask for next block
es: El hardware debería preguntar por el siguiente bloque

source: The hardware should say OK
es: El hardware debería decir OK

source: The programmer is not connected
es: El programador no está conectado

source: This is a 32bit application running under a 64bit Window version. UsbPicProg won't be able to connect to the hardware! Please uninstall this program and download the UsbPicProg installer for 64bit operating systems.
es: Esta es una aplicación de 32 bits ejecutándose en una versión de Windows de 64 bits. ¡UsbPicProg no podrá conectar con el hardware! Por favor desinstale este programa y descargue el instalador de UsbPicProg para sistemas operativos de 64 bits.

source: Trying to read memory outside allowed area: bc+i=%d; memory size=%d
es: Intentando leer memoria fuera del área permitida: bc+i=%d; tamaño de memoria=%d

source: Type:
es: Tipo:

source: Type: %d-bit microcontroller
es: Tipo: microcontrolador de %d-bit

source: USB error during blankcheck
es: Error de USB durante el vaciado del dispositivo

source: USB error during verify
es: Error de USB durante la verificación

source: USB error while writing code memory
es: Error de USB mientras se escribía en la memoria de código

source: Unable to open file
es: No se puede abrir el archivo

source: Unable to read firmware version
es: No se puede leer la versión del firmware

source: Unable to read version
es: No se puede leer la versión

source: Unable to run target
es: No se puede ejecutar el destino

source: Unable to save file
es: No se pudo guardar el archivo

source: Unable to stop target
es: No se puede detener el destino

source: Unknown error during blankcheck
es: Error desconocido durante la comprobación de vaciado

source: Unknown error during verify
es: Error desconocido durante la verificación

source: Unsupported Windows version. UsbPicProg runs only on Windows XP or later.
es: Versión de Windows no soportada. UsbPicProg sólo funciona en Windows XP o posterior.

source: Upgrade firmware?
es: ¿Actualizar el firmware?

source: Upgrade the firmware in usbpicprog
es: Actualizar el firmware en usbpicprog

source: Usbpicprog is not running in bootloader mode
es: Usbpicprog no está ejecutándose en modo bootloader

source: VDD pin
es: Pin VDD

source: VPP pin
es: Pin VPP

source: Variants:
es: Variantes:

source: Verify after programming
es: Verificar después de programar

source: Verify code
es: Verificar código

source: Verify code memory
es: Verificar memoria de código

source: Verify config
es: Verificar configuración

source: Verify config memory
es: Verificar memoria de configuración

source: Verify data
es: Verificar datos

source: Verify data memory
es: Verificar memoria de datos

source: Verify error while writing code memory
es: Error de verificación mientras se escribía en la memoria de código

source: Verify options
es: Opciones de verificación

source: Verify successful
es: Verificación realizada con éxito

source: Verify the PIC device
es: Verificar el dispositivo PIC

source: Verify unknown
es: Verificación desconocida

source: Verifying all areas of the PIC...
es: Verificando todas las áreas del PIC...

source: Word %d
es: Palabra %d

source: Write Code memory OK
es: Escritura de la memoria de código OK

source: Write Config memory OK
es: Escritura de la memoria de configuración OK

source: Write Data memory OK
es: Escritura de la memoria de datos OK

source: Write code memory
es: Escribir memoria de código

source: Write code not implemented for current PIC
es: Escritura de código no implementada para el PIC actual

source: Write config memory
es: Escribir memoria de configuración

source: Write config not implemented for current PIC
es: Escritura de configuración no implementada para el PIC actual

source: Write data memory
es: Escribir memoria de datos

source: Write data not implemented for current PIC
es: Escritura de datos no implementada para el PIC actual

source: You are using a development release of the firmware with a stable version of the software. Consider upgrading your firmware
es: Está usando una versión de desarrollo del firmware con una versión estable del software. Considere actualizar el firmware

source: You are using a stable release of the firmware with a development version of the software. Consider upgrading your firmware
es: Está usando una versión estable del firmware con una version de desarrollo del software. Considere actualizar el firmware

source: Your firmware is too old (latest version is %d); please consider upgrading it
es: Su firmware es demasiado antiguo (versión más reciente %d); por favor considere actualizarlo

source: Your firmware is too old (latest version is %d.%d.%d); please consider upgrading it
es: Su firmware es demasiado antiguo (versión más reciente %d.%d.%d); por favor considere actualizarlo

source: Zoom in
es: Agrandar

source: Zoom out
es: Disminuir

source: autodetect
es: autodetectar

source: blankcheck
es: comprobación de borrado

source: blankcheck the device
es: comprobar si el dispositivo está vacío

source: boot
es: arrancar

source: bulk erase the device
es: limpiar el dispositivo

source: currently selected PIC type
es: tipo de PIC actualmente seleccionado

source: debug
es: depurar

source: debug the hardware
es: depurar el hardware

source: displays help on the command line parameters
es: muestra la ayuda sobre los parámetros de la línea de comandos

source: displays version information of usbpicprog
es: muestra la información de versión de usbpicprog

source: do not display the hex file
es: no mostrar el archivo HEX

source: erase
es: borrar

source: file
es: archivo

source: help
es: ayuda

source: hexfile
es: archivo HEX

source: new
es: nuevo

source: open
es: abrir

source: packageview
es: vista de en capsulado

source: pictype
es: Tipo de PIC

source: program
es: programar

source: read
es: leer

source: read the device
es: leer el dispositivo

source: reload
es: recargar

source: reset
es: resetear

source: reset/reboot firmware/bootloader
es: resetear/reiniciar firmware/bootloader

source: restore-bandgap
es: restaurar-bandgap

source: restore-osccal
es: restaurar-osccal

source: run
es: ejecutar

source: run target device
es: correr el dispositivo de destino

source: save
es: guardar

source: save as
es: guardar como

source: silent
es: silencioso

source: specify the pic type (eg -p=18F2550)
es: Especificar el tipo de pic (e. g. -p=18F2550)

source: stop
es: detener

source: stop target device
es: detener el dispositivo de destino

source: tell firmware to reboot in bootloader mode
es: indicar al firmware que reinicie en modo bootloader

source: unknown record type: %d
es: tipo de registro desconocido: %d

source: untitled
es: sin título

source: verify
es: verificar

source: verify the device
es: verificar el dispositivo

source: version
es: versión

source: write
es: escribir

source: write the device
es: escribir el dispositivo
